<?php

/*
 * GET-запросы в PHP
 */


//http://myproject.loc/index.php?arg1=123&arg2=scrrr - здесь видно что после знака ? идут аргумента разделяемык знаком амперсанда

var_dump($_GET);
//при использовании URL - http://localhost:8080/level-5/get-requests.php?arg1=123&arg2=scrrr - мы видим переданный аргументы внутри массива get


//Открываем URL - http://localhost:8080/level-5/get-requests.php?login=admin&password=QWEasd123
$login = !empty($_GET['login']) ? $_GET['login'] : 'Логин не передан'; //условие - если индекс логин не пустой, то выводи логин иначе логин не передан
$password = !empty($_GET['password']) ? $_GET['password'] : 'Пароль не передан';

//GET - используется, чтобы показать данные о каком либо объекте, например, как было в тестовом задание показать данные о авиабилетах всем пользователем.
//Можно было бы внедрить функцию просмотра отдельно билета, тогда бы в ссылку передавалось ID этого билета из базы данных
?>

<html>
<head>
    <title>Знакомство с GET-запросами</title>
</head>
<body>
<p>
    Переданный логин: <?= $login ?>
    <br>
    Переданный пароль: <?= $password ?>
</p>
</body>
</html>
