<?php
//echo __DIR__; //путь, который построил докер
include __DIR__ . '/functions_file.php';

//require - тот же include, но прекращающий скрипт с фатальной ошибкой
//include_once и require_once - использование подключения один раз

//$var = include 'file.php'; - используется и записывается в переменную то, что возвращается файлом

?>
<html>
<head>
    <title>Чётные и нечётные числа</title>
</head>
<body>
    Число 2 <?= isEven(2) ? 'чётное' : 'нечётное' ?>
    <br>
    Число 5 <?= isEven(5) ? 'чётное' : 'нечётное' ?>
    <br>
    Число 8 <?= isEven(8) ? 'чётное' : 'нечётное' ?>
</body>
</html>
