<?php
/*
 * Переменные в PHP
 */
echo "<h1>Переменные</h1>";
//Задание 1: поменять значения переменных с помощью третьей переменной
$a=3;
$b=5;

echo "<h2>Задание 1</h2>";
echo "Значение переменных до изменения: a=$a , b=$b<br>";

$c=$a;
$a=$b;
$b=$c;

echo "Значение переменных после изменения: a=$a , b=$b<br><br>";

//Задание 2: поменять значения переменных без использования третьей переменной

//Переменные регистрозависимые
$A=3;
$B=5;

echo "<h2>Задание 2</h2>";
echo "Значение переменных до изменения: a=$A , b=$B<br>";

$A+=$B; //8
$B=$A-$B; //3
$A-=$B; //5

echo "Значение переменных после изменения: a=$A , b=$B<br><br>";



/*
 * Типизация в PHP
 */

/*
 * $var = 123; int
 * $var = 'string'; string
 * $var = 3.14; float
*/

//Внутри "" - можно указать переменную. Внутри '' - нельзя

//$var = 123;
//echo 'Значение переменной: ' . $var; // пример конкатенации строк с помощью .

//$string = 'Значение переменной: ' . $var; в переменной хранится строка с конкатеницией

//$x = 1;
//echo $x + '2'; //PHP сразу же преобразует строку в число и выведет результат сложения 3

//$string = '123';
//$numeric = (int) $string; //типизация с помощью оператора (int)

//var_dump(5/2); //var_dump - метод который выводит тип значения и само значения



/*
 * Операторы в PHP
 */
echo "<h2>Задание 3</h2>";

//+ - * / ** % - Типичные арифметические опраторы

//= += -= /= *= **= %= - Типичные операторы присваивания
//.= - отдельный оператор конкатенации строк

//< > <= >= == - Типичные операторы сравнения
//=== - отдельный оператор, который сначала сравнивает типы данных, а потом данные
//<=> - при a > b вернёт 1; при a = b вернёт 0; при a < b вернёт -1

//Операторы для циклов

//++$i - сначала добавляет единицу потом использует значение
//--$i - сначала убавляет единицу потом использует значение
//$i++ - сначала использует значение потом добавляет единицу
//$i-- - сначала использует значение потом убавляет единицу

// $$ || ! - Типичные усовные операторы
// xor – исключающее ИЛИ, вернёт true, только если один из операндов true, а другой – false
//var_dump(5/2); //var_dump - метод который выводит тип значения и само значения

//Задание 3 - вывод типов и значение с помощью var_dump()
var_dump(!1);
echo "<br>";
var_dump(!0);
echo "<br>";
var_dump(!true);
echo "<br>";
var_dump(2 && 3);
echo "<br>";
var_dump(5 && 0);
echo "<br>";
var_dump(3 || 0);
echo "<br>";
var_dump(5/1);
echo "<br>";
var_dump(1/5);

var_dump(5 + '5string');
echo "<br>";
var_dump('5' == 5);
echo "<br>";
var_dump('05' == 5);
echo "<br>";
var_dump('05' == '5');


