<?php
//array_key_exists('password', $array) - проверка существования ключа
//in_array(7, $numbers) - проверка сущетсвования значения
//array_merge($articlesFromIvan, $articlesFromMaria) - объединение двух массивов в один
//при объединении массивов, второй массив может замещать значения в первом массиве, если ключи у значений одинаковые

echo "<h1>Задание 1</h1>";

$arr1 = [1, 3, 2];

sort($arr1); //сортировка массива по возрастанию
$result = implode(':' ,$arr1); //склеивание массива в строку

echo $result;

echo "<h1>Задание 2</h1>";
$arr2 = [1, 2, 3, 4, 5];

$slice = array_slice($arr2, 1, 3); //срез массива 0 - с какого индекса, 3 - это сколько элементов нужно убрать

var_dump($slice);


