<?php
$file = fopen(__DIR__ . '/file.txt', 'r');
//fopen - функция открытия файла
//__DIR__ . 'file.txt' - путь до файла, в данном случае он находится в той же директории, что и PHP-файл
//'r' - режим открытия файла

/*
 * РЕЖИМЫ ОТКРЫТИЯ ФАЙЛОВ:
 * 'r' - только чтение. файл должен уже быть
 * 'r+' - чтение + запись. файл должен уже быть
 * 'w' - запись с удалением содержимого
 * 'w+' - запись с удалением содержмого + чтение
 * 'a' - запись в конец файла
 * 'a+' - запись в конец + чтение с конца
 * 'x' - запись в начало файла и создание нового файла
 * 'x+' - запись в начало файла и создание нового файла + чтение
 * 'c' - запись в конец файла без стирания содержимого
 * 'c+' - запись в конец файла без стирания содержимого
 */

//for ($i = 0; $i < 4; $i++) {
//    echo fgets($file); //fgets - считывает строку и возращает её нам
//    echo '<br>';
//}

//feof - функция возращающая true - когда доходит до конца файла, иначе false

while (!feof($file)) { //тот же скрипт, что и for с $i, но удобнее
    echo fgets($file);
    echo '<br>';
}

fclose($file); //функция закрытия файлов

$file = fopen(__DIR__ . '/file2.txt', 'w');
for ($i = 1; $i < 101; $i++) {
    fputs($file, $i . PHP_EOL);
    //PHP_EOL - символ переноса строки для разных систем
    //fputs - запись в $file данных
}
fclose($file);

$file = fopen(__DIR__ . '/file3.txt', 'a');
fputs($file, 'abc' . PHP_EOL);
fclose($file);

$data = file_get_contents(__DIR__ . '/file.txt'); //file_get_contents() - фукция полного прочтения и вывода файла. принимает только путь файла
echo $data;

$data = 'abc' . PHP_EOL . 'def' . PHP_EOL;
file_put_contents(__DIR__ . '/file3.txt', $data); //file_put_content() - функция полной записи в файл. Принимает путь файла и данные

file_put_contents(__DIR__ . '/file3.txt', $data, FILE_APPEND); //третий аргумент, можно представить в виде режима. FILE_APPEND - значит, что запись производится в конец файла не перезаписывая файл